app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "Math"], ["room_number", 8]]
---
    def create
        @school_class = SchoolClass.new(params.require(:school_class).permit!)
        @school_class.save