app/controllers/students_controller.rb

    def update
        @student = Student.update(params.require(:student).permit(:first_name, :last_name))
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Borne"], ["updated_at", "2020-10-27 23:00:50.352861"], ["id", 1]]